InformationRegisters/ОбновлениеАналитикиСтажейКандидатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОбновлениеАналитикиСтажейКандидатов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Кандидат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кандидаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОбновлениеАналитикиУкомплектованностиШтата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОбновлениеАналитикиУкомплектованностиШтата</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПозицияШтатногоРасписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиАналитикиДанныхКадровогоУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиАналитикиДанныхКадровогоУчета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АналитикаУкомплектованностиШтата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>АналитикаУкомплектованностиШтата</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Утверждена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Закрыта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Принято</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Занято</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Уволено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботыСотрудников</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
						<v8:Type>cfg:CatalogRef.РежимыРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУтверждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МестоВСтруктуреПредприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияПерсонала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтрокиОтчетностиМониторингаРаботниковСоциальнойСферы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияПриема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОТМин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОТМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонныйКоэффициентРазмер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонныйКоэффициентРазмерМин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонныйКоэффициентРазмерМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СевернаяНадбавкаРазмер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СевернаяНадбавкаРазмерМин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СевернаяНадбавкаРазмерМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкладТариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкладТарифМин</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкладТарифМакс</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияЗарплатыВБухучете</Name>
					<Comment>АПК:58 Способ отражения описывает счет и субконто</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтношениеКЕНВД</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ОтношениеКЕНВДЗатратНаЗарплату</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяФинансирования</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифнаяСетка</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСетки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрядКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазрядыКатегорииДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифнаяСеткаНадбавки</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСетки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрядКатегорияНадбавки</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.РазрядыКатегорииДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НадбавкаЗаВредностьРазмер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НадбавкаЗаВредностьРазмерМин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НадбавкаЗаВредностьРазмерМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРаботСДосрочнойПенсией</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДосрочногоНазначенияПенсии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияДосрочногоНазначенияПенсии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыеУсловияТрудаПФР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТрудаПФР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПозицииСпискаПФР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыплачиваетсяНадбавкаЗаВредность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНадбавкиЗаВредность</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактерВыполняемыхРаботПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныеДокументыПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТрудоваяФункция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТрудовыеФункции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПозицияШтатногоРасписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассматривается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/КадровыйУчетАналитикаДанных/Ext/Module.bsl
// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//   Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//                                   общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.24.202";
	Обработчик.Процедура = "КадровыйУчетАналитикаДанных.ПриНачальномЗаполненииПодсистемыАналитикаДанных";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("72f8dd79-f6bc-11ec-8499-ca102586f8a5");
	Обработчик.Комментарий = НСтр("ru = 'Начальное заполнение аналитики данных: кадровый учет.'");
	
КонецПроцедуры

// Процедура выполняет начальное заполнение аналитики данных
//
// Параметры:
//  ПараметрыОбновления - Структура - описывает текущие параметры обновления:
//   * ОбработкаЗавершена - Булево
//
Процедура ПриНачальномЗаполненииПодсистемыАналитикаДанных(ПараметрыОбновления = Неопределено) Экспорт
	
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ДатаНачалаАналитики = АналитикаДанных.ДатаНачалаАналитики();
	ПодборПерсонала.СоздатьВТПринятыеКандидаты(Запрос.МенеджерВременныхТаблиц, ДатаНачалаАналитики, КонецДня(ТекущаяДатаСеанса()));
	
	УправлениеШтатнымРасписанием.СоздатьВТШтатноеРасписание(
		Запрос.МенеджерВременныхТаблиц, Истина, УправлениеШтатнымРасписанием.ПараметрыПостроенияВТШтатноеРасписание());
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачалаАналитики);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|	ПринятыеКандидаты.Кандидат КАК Кандидат
		|ИЗ
		|	ВТПринятыеКандидаты КАК ПринятыеКандидаты
		|ГДЕ
		|	НЕ ПринятыеКандидаты.Кандидат В
		|		(ВЫБРАТЬ
		|			ОбновлениеАналитики.Кандидат КАК Кандидат
		|		ИЗ
		|			РегистрСведений.ОбновлениеАналитикиСтажейКандидатов КАК ОбновлениеАналитики)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|	&ДатаНачала КАК Дата,
		|	ШтатноеРасписание.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания
		|ИЗ
		|	ВТШтатноеРасписание КАК ШтатноеРасписание
		|ГДЕ
		|	НЕ ШтатноеРасписание.ПозицияШтатногоРасписания В
		|		(ВЫБРАТЬ
		|			ОбновлениеАналитики.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания
		|		ИЗ
		|			РегистрСведений.ОбновлениеАналитикиУкомплектованностиШтата КАК ОбновлениеАналитики)";
	
	РезультатыЗапросов = Запрос.ВыполнитьПакет();
	
	Если РезультатыЗапросов[0].Пустой() И РезультатыЗапросов[1].Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	
	ЗарегистрироватьОбновлениеАналитикиСтажейКандидатов(РезультатыЗапросов[0].Выгрузить());
	ЗарегистрироватьОбновлениеАналитикиУкомплектованности(РезультатыЗапросов[1].Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#Область ОбменДанными

// См. СинхронизацияДанныхЗарплатаКадрыИнтеграцияПодсистем.ЗаполнитьТаблицуЗависимыхДанных.
Процедура ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные) Экспорт
	
	// Метаданные.РегистрыСведений.КадроваяИсторияСотрудников
	НоваяСтрока = ЗависимыеДанные.Добавить();
	НоваяСтрока.ВедущиеМетаданные = Метаданные.РегистрыСведений.КадроваяИсторияСотрудников;
	НоваяСтрока.ЗависимыеМетаданные = Метаданные.РегистрыСведений.ОбновлениеАналитикиСтажейКандидатов;
	
	НоваяСтрока = ЗависимыеДанные.Добавить();
	НоваяСтрока.ВедущиеМетаданные = Метаданные.РегистрыСведений.КадроваяИсторияСотрудников;
	НоваяСтрока.ЗависимыеМетаданные = Метаданные.РегистрыСведений.ОбновлениеАналитикиУкомплектованностиШтата;
	
	// Метаданные.Справочники.ИсторияИспользованияШтатногоРасписания
	НоваяСтрока = ЗависимыеДанные.Добавить();
	НоваяСтрока.ВедущиеМетаданные = Метаданные.РегистрыСведений.ИсторияИспользованияШтатногоРасписания;
	НоваяСтрока.ЗависимыеМетаданные = Метаданные.РегистрыСведений.ОбновлениеАналитикиУкомплектованностиШтата;
	
КонецПроцедуры

#КонецОбласти

#Область РегламентныеЗадания

Процедура ПриОбновленииАналитикиДанных() Экспорт
	
	ОбновитьАналитикуУкомплектованностиШтата();
	ОбновитьАналитикуСтажейКандидатов();
	
КонецПроцедуры

#КонецОбласти

#Область ОснованияДляОбновленияАналитикиДанных

// Заполняет таблицу обновления кадровой истории.
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.КадроваяИсторияСотрудников
Процедура ЗаполнитьТаблицыОбновленияКадровойИстории(Источник) Экспорт
	
	Источник.ДополнительныеСвойства.Вставить("ТаблицаОбновленияКадровойИсторииДляСтажейКандидатов",
		ТаблицаОбновленияКадровойИсторииДляСтажейКандидатов(Источник));
	Источник.ДополнительныеСвойства.Вставить("ТаблицаОбновленияКадровойИсторииДляУкомплектованности",
		ТаблицаОбновленияКадровойИсторииДляУкомплектованности(Источник));
	
КонецПроцедуры

// Заполняет таблицу обновления истории использования штатного расписания.
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.ИсторияИспользованияШтатногоРасписания
Процедура ЗаполнитьТаблицуОбновленияИсторииИспользованияШтатногоРасписания(Источник) Экспорт
	
	Источник.ДополнительныеСвойства.Вставить("ТаблицаОбновленияШтатногоРасписанияДляУкомплектованности",
		ТаблицаОбновленияШтатногоРасписанияДляУкомплектованности(Источник));
	
КонецПроцедуры

#КонецОбласти

// Регистрация обновления аналитики стажей сотрудников.
// 
// Параметры:
//  ТаблицаОбновления - См. НоваяТаблицаОбновлениеАналитикиСтажейКандидатов
Процедура ЗарегистрироватьОбновлениеАналитикиСтажейКандидатов(ТаблицаОбновления) Экспорт
	
	Если ТаблицаОбновления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаОбновления.Свернуть("Кандидат");
	
	УстановитьПривилегированныйРежим(Истина);
	
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ОбновлениеАналитикиСтажейКандидатов");
	ЭлементБлокировкиДанных.ИсточникДанных = ТаблицаОбновления;
	ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных("Кандидат", "Кандидат");
	ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
	
	НачатьТранзакцию();

	Попытка
		БлокировкаДанных.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.ОбновлениеАналитикиСтажейКандидатов.СоздатьНаборЗаписей();
		Для Каждого СтрокаТаблицы Из ТаблицаОбновления Цикл
			НаборЗаписей.Очистить();
			Если ЗначениеЗаполнено(СтрокаТаблицы["Кандидат"]) Тогда
				ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), СтрокаТаблицы);
			КонецЕсли;
			НаборЗаписей.Отбор["Кандидат"].Установить(СтрокаТаблицы["Кандидат"]);
			НаборЗаписей.Записать();
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Аналитика данных.Регистрация обновления аналитики стажей кандидатов'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , , ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Возвращает таблицу изменившихся данных набора.
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.КадроваяИсторияСотрудников - Источник
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица изменившихся данных набора:
//   * Период - Дата
//   * НовоеЗначениеДолжностьПоШтатномуРасписанию - СправочникСсылка.ШтатноеРасписание
//   * СтароеЗначениеДолжностьПоШтатномуРасписанию - СправочникСсылка.ШтатноеРасписание
Функция ТаблицаИзменившихсяДанныхНабора(Источник) Экспорт
	Возврат Источник.ТаблицаИзменившихсяДанныхНабора();
КонецФункции

// При инициализации наборов регистров обновления аналитики данных.
// 
// Параметры:
//  НаборРегистров - Массив
Процедура ПриИнициализацииНаборовРегистровОбновленияАналитикиДанных(НаборРегистров) Экспорт
	
	НаборРегистров.Добавить(Метаданные.РегистрыСведений.ОбновлениеАналитикиСтажейКандидатов.ПолноеИмя());
	НаборРегистров.Добавить(Метаданные.РегистрыСведений.ОбновлениеАналитикиУкомплектованностиШтата.ПолноеИмя());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПодключениеСобытийОбновленияАналитикиДанных

// Зарегистрировать изменение кадровой истории сотрудников.
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.КадроваяИсторияСотрудников - Источник
//  Отказ - Булево - Отказ
//  Замещение - Булево - Замещение
Процедура ЗарегистрироватьИзменениеКадровойИсторииДляКадровыйУчетАналитикаДанныхПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	ЗарегистрироватьОбновлениеАналитикиСтажейКандидатов(ТаблицаОбновленияКадровойИсторииДляСтажейКандидатов(Источник));
	ЗарегистрироватьОбновлениеАналитикиУкомплектованности(ТаблицаОбновленияКадровойИсторииДляУкомплектованности(Источник));
	
КонецПроцедуры

// Зарегистрировать изменение штатного расписания для аналитики укомплектованности штата при записи.
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.ИсторияИспользованияШтатногоРасписания - Источник
//  Отказ - Булево - Отказ
//  Замещение - Булево - Замещение
Процедура ЗарегистрироватьИзменениеШтатногоРасписанияДляАналитикиДанныхПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	ЗарегистрироватьОбновлениеАналитикиУкомплектованности(ТаблицаОбновленияШтатногоРасписанияДляУкомплектованности(Источник));
	
КонецПроцедуры

// Зарегистрировать изменение кандидата.
// 
// Параметры:
//  Источник - СправочникОбъект.Кандидаты - Источник
//  Отказ - Булево - Отказ
Процедура ЗарегистрироватьИзменениеКандидатаДляАналитикиДанныхПриЗаписи(Источник, Отказ) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаОбновлениеАналитикиСтажейКандидатов = НоваяТаблицаОбновлениеАналитикиСтажейКандидатов();
	
	ЗаполнитьТаблицуОбновленияАналитикиСтажейКандидатовПоКандидату(ТаблицаОбновлениеАналитикиСтажейКандидатов, Источник);
	
	ЗарегистрироватьОбновлениеАналитикиСтажейКандидатов(ТаблицаОбновлениеАналитикиСтажейКандидатов);
	
КонецПроцедуры

// Зарегистрировать изменение физических лиц кандидатов.
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.ФизическиеЛицаКандидатов - Источник
//  Отказ - Булево - Отказ
Процедура ЗарегистрироватьИзменениеФизическихЛицКандидатовДляАналитикиДанныхПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	ЛичныеДанныеКандидатов = Новый Массив;
	НовыеЛичныеДанныеНабора = Источник.ВыгрузитьКолонку("ЛичныеДанныеКандидата");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ЛичныеДанныеКандидатов, НовыеЛичныеДанныеНабора);
	
	Если Источник.ДополнительныеСвойства.Свойство("ПрежнийНабор") Тогда
		ПрежнийНабор = Источник.ДополнительныеСвойства["ПрежнийНабор"];
		ПрежниеЛичныеДанныеНабора = ПрежнийНабор.ВыгрузитьКолонку("ЛичныеДанныеКандидата");
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ЛичныеДанныеКандидатов, ПрежниеЛичныеДанныеНабора, Истина);
		Если ОбщегоНазначенияКлиентСервер.РазностьМассивов(ЛичныеДанныеКандидатов, НовыеЛичныеДанныеНабора).Количество() = 0
		   И ОбщегоНазначенияКлиентСервер.РазностьМассивов(ЛичныеДанныеКандидатов, ПрежниеЛичныеДанныеНабора).Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ЛичныеДанныеКандидатов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаКандидатов = ПодборПерсонала.КандидатыПоЛичнымДаннымКандидатов(ЛичныеДанныеКандидатов);
	УстановитьПривилегированныйРежим(Ложь);
	
	ЗарегистрироватьОбновлениеАналитикиСтажейКандидатов(ТаблицаКандидатов);
	
КонецПроцедуры

Процедура ЗапомнитьПрежнееЗначениеФизическогоЛицаСотрудникаПередЗаписью(Источник, Отказ) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Источник.ЭтоНовый() Тогда
		Источник.ДополнительныеСвойства.Вставить("ФизическоеЛицоПрежнее",
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка, "ФизическоеЛицо"));
	КонецЕсли;
	
КонецПроцедуры

// Зарегистрировать изменение сотрудника.
// 
// Параметры:
//  Источник - СправочникОбъект.Сотрудники - Источник
//  Отказ - Булево - Отказ
Процедура ЗарегистрироватьИзменениеФизическогоЛицаСотрудникаПриЗаписи(Источник, Отказ) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	ФизическиеЛица = Новый Массив;
	ФизическиеЛица.Добавить(Источник.ФизическоеЛицо);
	
	Если Источник.ДополнительныеСвойства.Свойство("ФизическоеЛицоПрежнее") Тогда
		Если Источник.ФизическоеЛицо = Источник.ДополнительныеСвойства.ФизическоеЛицоПрежнее Тогда
			Возврат;
		КонецЕсли;
		ФизическиеЛица.Добавить(Источник.ДополнительныеСвойства.ФизическоеЛицоПрежнее);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаКандидатов = ПодборПерсонала.КандидатыФизическихЛиц(ФизическиеЛица);
	УстановитьПривилегированныйРежим(Ложь);
	
	ЗарегистрироватьОбновлениеАналитикиСтажейКандидатов(ТаблицаКандидатов);
	
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьТаблицуОбновленияАналитикиСтажейКандидатовПоКандидату(ТаблицаОбновлениеАналитикиСтажейКандидатов, Источник)
	
	Если Источник.ДополнительныеСвойства.Свойство("ПрежниеДанные") Тогда
		ПрежниеДанные = Источник.ДополнительныеСвойства.ПрежниеДанные;
		
		Если Источник.Состояние <> Перечисления.СостоянияСогласования.Согласовано
			И ПрежниеДанные.Состояние <> Перечисления.СостоянияСогласования.Согласовано Тогда
			Возврат;
		КонецЕсли;
		
		Если Источник.ПометкаУдаления <> ПрежниеДанные.ПометкаУдаления
		 Или Источник.ЛичныеДанные <> ПрежниеДанные.ЛичныеДанныеКандидата
		 Или Источник.ДатаРешения <> ПрежниеДанные.ДатаРешения
		 Или Источник.Состояние <> ПрежниеДанные.Состояние
		 Или Источник.Позиция <> ПрежниеДанные.Позиция
		 Или Источник.Подразделение <> ПрежниеДанные.Подразделение Тогда
			ТаблицаОбновлениеАналитикиСтажейКандидатов.Добавить().Кандидат = Источник.Ссылка;
		КонецЕсли;
	Иначе
		Если Источник.Состояние <> Перечисления.СостоянияСогласования.Согласовано Тогда
			Возврат;
		КонецЕсли;
		ТаблицаОбновлениеАналитикиСтажейКандидатов.Добавить().Кандидат = Источник.Ссылка;
	КонецЕсли;

КонецПроцедуры

// Регистрация обновления аналитики укомплектованности штата.
// 
// Параметры:
//  ТаблицаОбновления - См. НоваяТаблицаОбновлениеАналитикиУкомплектованностиШтата
Процедура ЗарегистрироватьОбновлениеАналитикиУкомплектованности(ТаблицаОбновления) Экспорт
	
	Если ТаблицаОбновления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаОбновления = СвернутаяТаблицаОбновленияАналитикиУкомплектованностиШтата(ТаблицаОбновления);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Блокировка = Новый БлокировкаДанных();
	Блокировка.Добавить("РегистрСведений.ОбновлениеАналитикиУкомплектованностиШтата");
	
	НачатьТранзакцию();

	Попытка
		Блокировка.Заблокировать();
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ОбновлениеАналитикиУкомплектованностиШтата");
		ЭлементБлокировкиДанных.ИсточникДанных = ТаблицаОбновления;
		ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных("ПозицияШтатногоРасписания", "ПозицияШтатногоРасписания");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		Для Каждого СтрокаТаблицы Из ТаблицаОбновления Цикл
			НаборЗаписей = РегистрыСведений.ОбновлениеАналитикиУкомплектованностиШтата.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ПозицияШтатногоРасписания.Установить(СтрокаТаблицы.ПозицияШтатногоРасписания);
			НаборЗаписей.Прочитать();
			
			ОбновитьДатуЗаписи = Истина;
			Для Каждого Запись Из НаборЗаписей Цикл
				Если Запись.Дата < СтрокаТаблицы.Дата Тогда
					ОбновитьДатуЗаписи = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если Не ОбновитьДатуЗаписи Тогда
				Продолжить;
			КонецЕсли;
			
			НаборЗаписей.Очистить();
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), СтрокаТаблицы);
			НаборЗаписей.Записать();
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Аналитика данных.Регистрация обновления аналитики укомплектованности'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , , ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Конструктор таблицы обновления аналитики стажей сотрудников.
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//   * Кандидат - СправочникСсылка.Кандидаты
Функция НоваяТаблицаОбновлениеАналитикиСтажейКандидатов() Экспорт
	Возврат ОбщегоНазначенияБЗК.ТаблицаЗначенийПоИмениРегистраСведений("ОбновлениеАналитикиСтажейКандидатов");
КонецФункции

// Конструктор таблицы обновления аналитики укомплектованности штата.
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//   * Дата - Дата - 
//   * ПозицияШтатногоРасписания - СправочникСсылка.ШтатноеРасписание 
Функция НоваяТаблицаОбновлениеАналитикиУкомплектованностиШтата() Экспорт
	Возврат ОбщегоНазначенияБЗК.ТаблицаЗначенийПоИмениРегистраСведений("ОбновлениеАналитикиУкомплектованностиШтата");
КонецФункции

// Конструктор таблицы  аналитики укомплектованности штата.
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//   * Дата - Дата - 
//   * ПозицияШтатногоРасписания - СправочникСсылка.ШтатноеРасписание 
Функция НоваяТаблицаАналитикаУкомплектованностиШтата()
	Возврат ОбщегоНазначенияБЗК.ТаблицаЗначенийПоИмениРегистраСведений("АналитикаУкомплектованностиШтата");
КонецФункции

Функция НоваяТаблицаАналитикаСтажейКандидатов()
	Возврат ОбщегоНазначенияБЗК.ТаблицаЗначенийПоИмениРегистраСведений("АналитикаСтажейКандидатов");
КонецФункции

#Область ОснованияДляОбновленияАналитикиДанных

// Возвращает таблицу обновления кадровой истории.
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.КадроваяИсторияСотрудников - Источник
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица обновления
Функция ТаблицаОбновленияКадровойИсторииДляСтажейКандидатов(Источник)
	
	ТаблицаОбновления = НоваяТаблицаОбновлениеАналитикиСтажейКандидатов();
	ИзменившиесяДанные = ТаблицаИзменившихсяДанныхНабора(Источник);
	
	Если ИзменившиесяДанные <> Неопределено Тогда
		КандидатыФизическихЛиц = ПодборПерсонала.КандидатыФизическихЛиц(ИзменившиесяДанные.ВыгрузитьКолонку("ФизическоеЛицо"));
		КандидатыФизическихЛиц.Индексы.Добавить("ФизическоеЛицо");
		ВидСобытияПрием = Перечисления.ВидыКадровыхСобытий.Прием;
		ВидСобытияУвольнение = Перечисления.ВидыКадровыхСобытий.Увольнение;
		Для Каждого СтрокаТаблицы Из ИзменившиесяДанные Цикл
			КандидатыФизическогоЛица = КандидатыФизическихЛиц.НайтиСтроки(
				Новый Структура("ФизическоеЛицо", СтрокаТаблицы.ФизическоеЛицо));
			Если КандидатыФизическогоЛица.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			Если СтрокаТаблицы["Добавление"] = Истина
				И (СтрокаТаблицы.НовоеЗначениеВидСобытия = ВидСобытияПрием
				Или СтрокаТаблицы.НовоеЗначениеВидСобытия = ВидСобытияУвольнение) Тогда
				
				Для Каждого СтрокаКандидат Из КандидатыФизическогоЛица Цикл
					НоваяСтрока = ТаблицаОбновления.Добавить();
					НоваяСтрока.Кандидат = СтрокаКандидат.Кандидат; // СправочникСсылка.Кандидаты
				КонецЦикла;
			ИначеЕсли СтрокаТаблицы["Удаление"] = Истина
				И (СтрокаТаблицы.СтароеЗначениеВидСобытия = ВидСобытияПрием
				Или СтрокаТаблицы.СтароеЗначениеВидСобытия = ВидСобытияУвольнение) Тогда
				
				Для Каждого СтрокаКандидат Из КандидатыФизическогоЛица Цикл
					НоваяСтрока = ТаблицаОбновления.Добавить();
					НоваяСтрока.Кандидат = СтрокаКандидат.Кандидат; // СправочникСсылка.Кандидаты
				КонецЦикла;
			ИначеЕсли СтрокаТаблицы["ИзменилсяРесурсВидСобытия"] = Истина
				И (СтрокаТаблицы.НовоеЗначениеВидСобытия = ВидСобытияПрием
				Или СтрокаТаблицы.СтароеЗначениеВидСобытия = ВидСобытияПрием
				Или СтрокаТаблицы.НовоеЗначениеВидСобытия = ВидСобытияУвольнение
				Или СтрокаТаблицы.СтароеЗначениеВидСобытия = ВидСобытияУвольнение) Тогда
						
				Для Каждого СтрокаКандидат Из КандидатыФизическогоЛица Цикл
					НоваяСтрока = ТаблицаОбновления.Добавить();
					НоваяСтрока.Кандидат = СтрокаКандидат.Кандидат; // СправочникСсылка.Кандидаты
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаОбновления;
	
КонецФункции

// Возвращает таблицу обновления кадровой истории.
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.КадроваяИсторияСотрудников - Источник
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица обновления
Функция ТаблицаОбновленияКадровойИсторииДляУкомплектованности(Источник)
	
	ТаблицаОбновления = НоваяТаблицаОбновлениеАналитикиУкомплектованностиШтата();
	ИзменившиесяДанные = ТаблицаИзменившихсяДанныхНабора(Источник);
	
	Если ИзменившиесяДанные <> Неопределено Тогда
		Для Каждого СтрокаТаблицы Из ИзменившиесяДанные Цикл
			Если СтрокаТаблицы["Добавление"] = Истина Тогда
				НоваяСтрока = ТаблицаОбновления.Добавить();
				НоваяСтрока.Дата = СтрокаТаблицы.Период;
				НоваяСтрока.ПозицияШтатногоРасписания = СтрокаТаблицы.НовоеЗначениеДолжностьПоШтатномуРасписанию;
			ИначеЕсли СтрокаТаблицы["Удаление"] = Истина Тогда
				НоваяСтрока = ТаблицаОбновления.Добавить();
				НоваяСтрока.Дата = СтрокаТаблицы.Период;
				НоваяСтрока.ПозицияШтатногоРасписания = СтрокаТаблицы.СтароеЗначениеДолжностьПоШтатномуРасписанию;
			ИначеЕсли СтрокаТаблицы["ИзменилсяРесурсДолжностьПоШтатномуРасписанию"] = Истина
				  Или СтрокаТаблицы["ИзменилсяРесурсКоличествоСтавок"] = Истина Тогда
				НоваяСтрока = ТаблицаОбновления.Добавить();
				НоваяСтрока.Дата = СтрокаТаблицы.Период;
				НоваяСтрока.ПозицияШтатногоРасписания = СтрокаТаблицы.НовоеЗначениеДолжностьПоШтатномуРасписанию;
				
				НоваяСтрока = ТаблицаОбновления.Добавить();
				НоваяСтрока.Дата = СтрокаТаблицы.Период;
				НоваяСтрока.ПозицияШтатногоРасписания = СтрокаТаблицы.СтароеЗначениеДолжностьПоШтатномуРасписанию;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаОбновления;
	
КонецФункции

Функция ТаблицаОбновленияШтатногоРасписанияДляУкомплектованности(Источник)
	
	ТаблицаОбновления = НоваяТаблицаОбновлениеАналитикиУкомплектованностиШтата();
	ИзменившиесяДанные = Источник.ТаблицаИзменившихсяДанныхНабора();
	
	Если ИзменившиесяДанные <> Неопределено Тогда
		Для Каждого СтрокаТаблицы Из ИзменившиесяДанные Цикл
			Если СтрокаТаблицы["Добавление"] = Истина
			 Или СтрокаТаблицы["Удаление"] = Истина
			 Или СтрокаТаблицы["ИзменилсяРесурсИспользуется"] = Истина
			 Или СтрокаТаблицы["ИзменилсяРесурсКоличествоСтавок"] = Истина Тогда
				ЗаполнитьЗначенияСвойств(ТаблицаОбновления.Добавить(), СтрокаТаблицы);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаОбновления;
	
КонецФункции

#КонецОбласти

Функция СвернутаяТаблицаОбновленияАналитикиУкомплектованностиШтата(ТаблицаОбновления)
	
	НоваяТаблицаОбновления = НоваяТаблицаОбновлениеАналитикиУкомплектованностиШтата();
	Позиция = Справочники.ШтатноеРасписание.ПустаяСсылка();
	
	ТаблицаОбновления.Сортировать("ПозицияШтатногоРасписания, Дата");
	Для Каждого СтрокаТаблицы Из ТаблицаОбновления Цикл
		Если СтрокаТаблицы.ПозицияШтатногоРасписания = Позиция Тогда
			Продолжить;
		КонецЕсли;
		Позиция = СтрокаТаблицы.ПозицияШтатногоРасписания;
		ЗаполнитьЗначенияСвойств(НоваяТаблицаОбновления.Добавить(), СтрокаТаблицы);
	КонецЦикла;
	
	Возврат НоваяТаблицаОбновления;
	
КонецФункции

#Область Укомплектованность

Процедура ОбновитьАналитикуУкомплектованностиШтата(Позиции = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ДанныеНабора.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
		|	ДанныеНабора.Дата КАК Дата
		|ИЗ
		|	РегистрСведений.ОбновлениеАналитикиУкомплектованностиШтата КАК ДанныеНабора";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	ОтборЗапроса = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор;
	Если Позиции <> Неопределено Тогда
		ОтборЗапроса.Добавить("ДанныеНабора.ПозицияШтатногоРасписания В(&Позиции)");
		Запрос.УстановитьПараметр("Позиции", Позиции);
	КонецЕсли;
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДатаТекущегоМесяца = НачалоМесяца(ТекущаяДатаСеанса());
	ДополнитьОбновлениеАналитики = Не АналитикаДанныхКадровогоУчетаАктуальна(ДатаТекущегоМесяца);
	
	Пока Истина Цикл
		ТаблицаОбновления = Запрос.Выполнить().Выгрузить();
		Если ДополнитьОбновлениеАналитики Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаОбновления, НеактуальныеДанныеТекущегоМесяца(ДатаТекущегоМесяца));
		КонецЕсли;
		Если ТаблицаОбновления.Количество() = 0 Тогда
			Если ДополнитьОбновлениеАналитики Тогда
				Настройки = РегистрыСведений.НастройкиАналитикиДанныхКадровогоУчета.СоздатьМенеджерЗаписи();
				Настройки.ДатаАктуальности = ДатаТекущегоМесяца;
				Настройки.Записать();
			КонецЕсли;
			Прервать;
		КонецЕсли;
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОбновлениеАналитикиУкомплектованностиШтата"); 
		ЭлементБлокировки.ИсточникДанных = ТаблицаОбновления;
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ПозицияШтатногоРасписания", "ПозицияШтатногоРасписания");
		
		НачатьТранзакцию();
		Попытка
			Блокировка.Заблокировать();
			ОбновитьАналитикуУкомплектованностиШтатаПоТаблице(ТаблицаОбновления);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

// Обновить аналитику укомплектованности штата по таблице значений.
// 
// Параметры:
//  ТаблицаОбновления - ТаблицаЗначений:
//   * Дата - Дата
//   * ПозицияШтатногоРасписания - СправочникСсылка.ШтатноеРасписание
Процедура ОбновитьАналитикуУкомплектованностиШтатаПоТаблице(ТаблицаОбновления)
	
	АналитикаУкомплектованностиШтата = НоваяТаблицаАналитикаУкомплектованностиШтата();
	ЗаполнитьТаблицуАналитикиУкомплектованностиШтата(АналитикаУкомплектованностиШтата, ТаблицаОбновления);
	АналитикаУкомплектованностиШтата.Индексы.Добавить("ПозицияШтатногоРасписания");
	
	Для Каждого СтрокаТаблицы Из ТаблицаОбновления Цикл
		// Заполняем набор аналитики.
		НаборАналитика = РегистрыСведений.АналитикаУкомплектованностиШтата.СоздатьНаборЗаписей();
		НаборАналитика.Отбор.ПозицияШтатногоРасписания.Установить(СтрокаТаблицы.ПозицияШтатногоРасписания);
		НаборАналитика.Прочитать();
		
		АналитикаДанных.УдалитьСтрокиАналитикиПослеДатыОтбора(НаборАналитика, НачалоМесяца(СтрокаТаблицы.Дата));
		
		// Дополняем набор аналитики новыми строками.
		ОтборСтрок = Новый Структура("ПозицияШтатногоРасписания", СтрокаТаблицы.ПозицияШтатногоРасписания);
		НайденныеСтроки = АналитикаУкомплектованностиШтата.НайтиСтроки(ОтборСтрок);
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(НайденныеСтроки, НаборАналитика);
		
		// Подготавливаем к очистке набор обновления.
		НаборОбновления = РегистрыСведений.ОбновлениеАналитикиУкомплектованностиШтата.СоздатьНаборЗаписей();
		НаборОбновления.Отбор.ПозицияШтатногоРасписания.Установить(СтрокаТаблицы.ПозицияШтатногоРасписания);
		НачатьТранзакцию();
		Попытка
			НаборАналитика.Записать();
			НаборОбновления.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуАналитикиУкомплектованностиШтата(АналитикаУкомплектованностиШтата, ТаблицаОбновления)
	
	Если ТаблицаОбновления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяДата = КонецДня(ТекущаяДатаСеанса());
	ДатаНачалаАналитики = ТекущаяДата;
	
	ТаблицаПозицийШР = ТаблицаОбновления.СкопироватьКолонки();
	Для Каждого СтрокаОбновления Из ТаблицаОбновления Цикл
		ДатаНачала = НачалоМесяца(СтрокаОбновления.Дата);
		РазницаВМесяцах = ЗарплатаКадрыРасширенныйКлиентСервер.РазницаВМесяцах(СтрокаОбновления.Дата, ТекущаяДата);
		Для Сч = 0 По РазницаВМесяцах Цикл
			НоваяСтрока = ТаблицаПозицийШР.Добавить();
			НоваяСтрока.Дата = ДобавитьМесяц(ДатаНачала, Сч);
			НоваяСтрока.ПозицияШтатногоРасписания = СтрокаОбновления.ПозицияШтатногоРасписания;
		КонецЦикла;
		ДатаНачалаАналитики = Мин(ДатаНачалаАналитики, СтрокаОбновления.Дата);
	КонецЦикла;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(МенеджерВременныхТаблиц, ТаблицаПозицийШР, "ВТТаблицаПозицийШР", Истина);
	
	ПараметрыПостроения = УправлениеШтатнымРасписанием.ПараметрыПостроенияВТШтатноеРасписаниеПоТаблицеФильтра("ВТТаблицаПозицийШР", "Дата");
	ОписаниеРегистра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеРегистра("АналитикаУкомплектованностиШтата");
	
	Ресурсы = ОбщегоНазначения.СкопироватьРекурсивно(ОписаниеРегистра.Ресурсы);
	Индекс = Ресурсы.Найти("Принято");
	Если Индекс <> Неопределено Тогда
		Ресурсы.Удалить(Индекс);
	КонецЕсли;
	Индекс = Ресурсы.Найти("Уволено");
	Если Индекс <> Неопределено Тогда
		Ресурсы.Удалить(Индекс);
	КонецЕсли;
	ИменаРесурсов = СтрСоединить(Ресурсы, ",");
	ИменаРеквизитов = СтрСоединить(ОписаниеРегистра.Реквизиты, ",");
	ИменаСведений = ИменаРесурсов + "," + ИменаРеквизитов;
	
	ЗапросШтатноеРасписание = УправлениеШтатнымРасписанием.ЗапросВТШтатноеРасписание(Ложь, ПараметрыПостроения, ИменаСведений, "");
	ЗапросШтатноеРасписание.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	РезультатЗапросаШтатноеРасписание = ЗапросШтатноеРасписание.Выполнить();
	ВыборкаПозиции = РезультатЗапросаШтатноеРасписание.Выбрать();
	
	ПараметрыПолученияРабочихМест = КадровыйУчет.ПараметрыДляЗапросВТРабочиеМестаСотрудниковПоСпискуСотрудников();
	ПараметрыПолученияРабочихМест.НачалоПериода 	= НачалоМесяца(ДатаНачалаАналитики);
	ПараметрыПолученияРабочихМест.ОкончаниеПериода	= ТекущаяДата;
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПолученияРабочихМест.Отборы,
		"ДолжностьПоШтатномуРасписанию", "В", ТаблицаОбновления.ВыгрузитьКолонку("ПозицияШтатногоРасписания"));
	
	Запрос = КадровыйУчет.ЗапросВТРабочиеМестаСотрудниковПоСпискуСотрудников(
		Истина, "ВТРабочиеМестаСотрудников", ПараметрыПолученияРабочихМест, МенеджерВременныхТаблиц);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПОМЕСТИТЬ ВТРабочиеМестаСотрудников", "");
	ВыборкаСобытий = Запрос.Выполнить().Выбрать();
	
	ТаблицаСобытий = Новый ТаблицаЗначений;
	ТаблицаСобытий.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ТаблицаСобытий.Колонки.Добавить("ДолжностьПоШтатномуРасписанию", Новый ОписаниеТипов("СправочникСсылка.ШтатноеРасписание"));
	ТаблицаСобытий.Колонки.Добавить("Принято", Новый ОписаниеТипов("Число"));
	ТаблицаСобытий.Колонки.Добавить("Уволено", Новый ОписаниеТипов("Число"));
	
	Пока ВыборкаСобытий.Следующий() Цикл
		КоличествоСтавок = ВыборкаСобытий.КоличествоСтавок; // Число
		Если КоличествоСтавок = 0 Тогда
			Продолжить;
		КонецЕсли;
		Если ВыборкаСобытий.ВидСобытия = Перечисления.ВидыКадровыхСобытий.Прием
			ИЛИ ВыборкаСобытий.ВидСобытия = Перечисления.ВидыКадровыхСобытий.НачальныеДанные Тогда
			НоваяСтрока = ТаблицаСобытий.Добавить();
			НоваяСтрока.Принято = КоличествоСтавок;
		ИначеЕсли ВыборкаСобытий.ВидСобытия = Перечисления.ВидыКадровыхСобытий.Увольнение Тогда
			НоваяСтрока = ТаблицаСобытий.Добавить();
			НоваяСтрока.Уволено = КоличествоСтавок;
		Иначе
			Продолжить;
		КонецЕсли;
		ПериодСобытия = ВыборкаСобытий.Период; // Дата
		НоваяСтрока.Дата = НачалоМесяца(ПериодСобытия);
		ДолжностьПоШтатномуРасписанию = ВыборкаСобытий.ДолжностьПоШтатномуРасписанию; // СправочникСсылка.ШтатноеРасписание
		НоваяСтрока.ДолжностьПоШтатномуРасписанию = ДолжностьПоШтатномуРасписанию;
	КонецЦикла;
	
	ТаблицаСобытий.Свернуть("Дата, ДолжностьПоШтатномуРасписанию", "Принято, Уволено");
	ТаблицаСобытий.Индексы.Добавить("ДолжностьПоШтатномуРасписанию, Дата");
	
	СтруктураОтбора = НоваяСтруктураОтбораПозиций();
	
	Пока ВыборкаПозиции.Следующий() Цикл
		НоваяСтрока = АналитикаУкомплектованностиШтата.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПозиции);
		ПериодПозиции = ВыборкаПозиции.Период; // Дата
		НоваяСтрока.Дата = ПериодПозиции;
		
		СтруктураОтбора.ДолжностьПоШтатномуРасписанию = НоваяСтрока.ПозицияШтатногоРасписания;
		СтруктураОтбора.Дата = ПериодПозиции;
		
		НайденныеСтроки = ТаблицаСобытий.НайтиСтроки(СтруктураОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			НоваяСтрока.Уволено = НайденныеСтроки[0].Уволено;
			НоваяСтрока.Принято = НайденныеСтроки[0].Принято;
		КонецЕсли;;
	КонецЦикла;
	
КонецПроцедуры

Функция НоваяСтруктураОтбораПозиций()
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ДолжностьПоШтатномуРасписанию", Справочники.ШтатноеРасписание.ПустаяСсылка());
	СтруктураОтбора.Вставить("Дата", Дата(1, 1, 1));
	
	Возврат СтруктураОтбора;
	
КонецФункции

Функция АналитикаДанныхКадровогоУчетаАктуальна(ДатаТекущегоМесяца)
	
	Настройки = РегистрыСведений.НастройкиАналитикиДанныхКадровогоУчета.СоздатьМенеджерЗаписи();
	Настройки.Прочитать();
	
	Если Не Настройки.Выбран() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Настройки.ДатаАктуальности >= ДатаТекущегоМесяца;
	
КонецФункции

Функция НеактуальныеДанныеТекущегоМесяца(ДатаТекущегоМесяца)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийМесяц", ДатаТекущегоМесяца);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1000
			|	ДанныеНабора.ПозицияШтатногоРасписания,
			|	ДОБАВИТЬКДАТЕ(МАКСИМУМ(ДанныеНабора.Дата), МЕСЯЦ, 1)
			|ИЗ
			|	РегистрСведений.АналитикаУкомплектованностиШтата КАК ДанныеНабора
			|ГДЕ
			|	НЕ ДанныеНабора.ПозицияШтатногоРасписания В
			|		(ВЫБРАТЬ
			|			ДанныеНабора.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания
			|		ИЗ
			|			РегистрСведений.ОбновлениеАналитикиУкомплектованностиШтата КАК ДанныеНабора)
			|	И НЕ ДанныеНабора.Закрыта
			|СГРУППИРОВАТЬ ПО
			|	ДанныеНабора.ПозицияШтатногоРасписания
			|ИМЕЮЩИЕ
			|	МАКСИМУМ(ДанныеНабора.Дата) < &ТекущийМесяц";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Область СтажСотрудников

Процедура ОбновитьАналитикуСтажейКандидатов(Кандидаты = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ДанныеНабора.Кандидат КАК Кандидат
		|ИЗ
		|	РегистрСведений.ОбновлениеАналитикиСтажейКандидатов КАК ДанныеНабора";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	ОтборЗапроса = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор;
	Если Кандидаты <> Неопределено Тогда
		ОтборЗапроса.Добавить("ДанныеНабора.Кандидат В(&Кандидаты)");
		Запрос.УстановитьПараметр("Кандидаты", Кандидаты);
	КонецЕсли;
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Пока Истина Цикл
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Прервать;
		КонецЕсли;
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОбновлениеАналитикиСтажейКандидатов"); 
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Кандидат", "Кандидат");
		
		НачатьТранзакцию();
		Попытка
			Блокировка.Заблокировать();
			ТаблицаОбновления = РезультатЗапроса.Выгрузить();
			ТаблицаОбновления.Индексы.Добавить("Кандидат");
			ОбновитьАналитикуСтажейКандидатовПоТаблице(ТаблицаОбновления);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьАналитикуСтажейКандидатовПоТаблице(ТаблицаОбновления)
	
	АналитикаСтажейКандидатов = НоваяТаблицаАналитикаСтажейКандидатов();
	ЗаполнитьТаблицуАналитикиСтажейКандидатов(АналитикаСтажейКандидатов, ТаблицаОбновления);
	АналитикаСтажейКандидатов.Индексы.Добавить("Кандидат");
	
	Для Каждого СтрокаТаблицы Из ТаблицаОбновления Цикл
		// Заполняем набор аналитики.
		НаборАналитика = РегистрыСведений.АналитикаСтажейКандидатов.СоздатьНаборЗаписей();
		НаборАналитика.Отбор.Кандидат.Установить(СтрокаТаблицы.Кандидат);
		
		// Дополняем набор аналитики новыми строками.
		ОтборСтрок = Новый Структура("Кандидат", СтрокаТаблицы.Кандидат);
		НайденныеСтроки = АналитикаСтажейКандидатов.НайтиСтроки(ОтборСтрок);
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(НайденныеСтроки, НаборАналитика);
		
		// Подготавливаем к очистке набор обновления.
		НаборОбновления = РегистрыСведений.ОбновлениеАналитикиСтажейКандидатов.СоздатьНаборЗаписей();
		НаборОбновления.Отбор.Кандидат.Установить(СтрокаТаблицы.Кандидат);
		НачатьТранзакцию();
		Попытка
			НаборАналитика.Записать();
			НаборОбновления.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуАналитикиСтажейКандидатов(АналитикаСтажейКандидатов, ТаблицаОбновления)
	
	Если ТаблицаОбновления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеФизическихЛицКандидатам = Справочники.Кандидаты.ФизическиеЛицаКандидатов(
		ТаблицаОбновления.ВыгрузитьКолонку("Кандидат"));
	ФизическиеЛицаКандидатов = Новый Массив;
	Для каждого КлючИЗначение Из СоответствиеФизическихЛицКандидатам Цикл
		ФизическиеЛицаКандидатов.Добавить(КлючИЗначение.Значение);
	КонецЦикла;
	СотрудникиФизическихЛиц = КадровыйУчетРасширенный.СотрудникиФизическихЛиц(
		ФизическиеЛицаКандидатов, Неопределено, Истина, Истина);
	КандидатыПоСотрудникам = ПодборПерсонала.КандидатыПоСотрудникам(СотрудникиФизическихЛиц);
	
	Если КандидатыПоСотрудникам.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КадровыеДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(Истина, СотрудникиФизическихЛиц,
		"ДатаПриема,НаходитсяНаИспытательномСроке,ИспытательныйСрокДатаЗавершения,ДатаУвольнения");
	КадровыеДанныеСотрудников.Индексы.Добавить("Сотрудник");
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Сотрудник = Неопределено;
	Для каждого Строка Из КандидатыПоСотрудникам Цикл
		Если Строка.Сотрудник = Сотрудник Тогда
			Продолжить;
		КонецЕсли;
		Сотрудник = Строка.Сотрудник;
		НайденныеСтроки = КадровыеДанныеСотрудников.НайтиСтроки(Новый Структура("Сотрудник", Строка.Сотрудник));
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		КадровыеДанныеСотрудника = НайденныеСтроки[0];
		НоваяСтрока = АналитикаСтажейКандидатов.Добавить();
		НоваяСтрока.Кандидат = Строка.Кандидат;
		НоваяСтрока.ДатаПриема = КадровыеДанныеСотрудника.ДатаПриема;
		НоваяСтрока.ДатаУвольнения = КадровыеДанныеСотрудника.ДатаУвольнения;
		НоваяСтрока.ИспытательныйСрокДатаЗавершения = КадровыеДанныеСотрудника.ИспытательныйСрокДатаЗавершения;
		НоваяСтрока.НаходитсяНаИспытательномСроке =
			ЗначениеЗаполнено(НоваяСтрока.ИспытательныйСрокДатаЗавершения) И НоваяСтрока.ИспытательныйСрокДатаЗавершения > ТекущаяДата;
		Если Не НоваяСтрока.НаходитсяНаИспытательномСроке И КадровыеДанныеСотрудника.ИспытательныйСрокДатаЗавершения = Неопределено Тогда
			НоваяСтрока.ИспытательныйСрокДатаЗавершения = НоваяСтрока.ДатаПриема;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
